#Задача 2: Найдите сумму цифр трехзначного числа.

n = input('Введите трехзначное число: ')
print(int(n[0])+int(n[1])+int(n[2]))